lab12/app/controllers/users_controller.rb

  def check_if_admin
    current_user = User.find_by(id: session[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]

  def index
    check_if_admin
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
  p user_params
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)