lab11/app/controllers/handler_controller.rb

SELECT  "recs".* FROM "recs" WHERE "recs"."seq" = ? LIMIT ?  [["seq", "1 2 3 4 1 2 3"], ["LIMIT", 1]]
INSERT INTO "recs" ("seq", "res", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def answer
    rec = Rec.find_by(seq: params[:arr])
    if rec.nil? then
        rec = Rec.new do |r|
          r.result = params[:arr]
        end
        rec.save